In [8]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

In [205]:
page = requests.get('https://en.wikipedia.org/wiki/List_of_main_battle_tanks_by_country')
soup = BeautifulSoup(page.content, 'lxml')

# print(soup.prettify())

In [206]:
tables=soup.findAll('table', class_='wikitable')
# tables

In [11]:
#ensure that in quantity column are ints only (without letter or symbols)
import re
pattern = re.compile('[0-9]+(,[0-9]+)?')
pattern.match('None')

In [208]:
A=[]
B=[]
C=[]
D=[]
E=[]
prev_country_name = ''

names = {
    'AMX 13': 'AMX-13',
    'Type 69/79': 'Type 69',
    'M1/M1A1/M1A2': 'M1A1',
    '\n': 'T-72M1',
    'Leopard 2A4+ and 2A4MCAN': 'Leopard 2A4',
    'Leopard 2A4/2A5': 'Leopard 2A4',
    'Leopard 2A5/A6/A6M/A7': 'Leopard 2A5',
    'Leopard 1A3/A4': 'Leopard 1A3',
    'Leopard 1A4/5': 'Leopard 1A4',
    'T72M1M': 'T-72M1'
}

countries = {
    'Congo, Democratic Republic of': 'Democratic Republic of the Congo',
    'Congo, Republic of': 'Congo',
    'Republic of China (Taiwan)': 'Taiwan',
    'Korea, North': 'North Korea',
    'Korea, South': 'South Korea',
    'Macedonia, Republic of': 'Republic of Macedonia'
    
}
#for all tables on wikipedia page
for table in tables:
    #find all tr tags to access data
    rows = table.find_all('tr')
    for row in rows:
        #find all td tags - to acess all rows of wiki tables
        cells = row.find_all('td')
        if len(cells)==5:
            #in country column find links to wikipedia country pages
            clink = (cells[3].findAll('a'))
            quantity = str(cells[2].find(text=True))
            match = pattern.match(quantity)
            
            tank_name = str(cells[1].find(text=True))
            country_name = str(cells[0].find(text=True))
            #replace tank name with equivalent provided in dict 'names' - tidying data
            if tank_name in names:
                tank_name = names[tank_name]
            #replace country name with equivalent provided in dict 'countries' - tidying data
            if country_name in countries:
                country_name = countries[country_name]
            #append lists
            if match:
                A.append(country_name)
                prev_country_name = country_name
                B.append(tank_name)
                C.append(int(''.join(match.group(0).split(','))))
                D.append(clink[0].contents[0])
                E.append(cells[4].find(text=True))
        elif len(cells)==4:
            clink = (cells[2].findAll('a'))
            quantity = str(cells[1].find(text=True))
            match = pattern.match(quantity)
            
            tank_name = str(cells[0].find(text=True))
            
            if tank_name in names:
                tank_name = names[tank_name]
                
            if match:
                A.append(prev_country_name)
                B.append(tank_name)
                C.append(int(''.join(match.group(0).split(','))))
                D.append(clink[0].contents[0])
                E.append(cells[3].find(text=True))

In [187]:
import pandas as pd
#create dataframe
df=pd.DataFrame(A,columns=['Country '])
df['Type ']=B
df['Quantity (Estimated)']=C
df['Origin ']=D
# df
print(df.to_string())

                             Country                      Type   Quantity (Estimated)         Origin
0                         Afghanistan                      T-55                   601    Soviet Union
1                         Afghanistan                      T-62                   170    Soviet Union
2                             Algeria                      T-55                   270    Soviet Union
3                             Algeria                      T-62                   300    Soviet Union
4                             Algeria                      T-72                   325    Soviet Union
5                             Algeria                     T-90A                   300          Russia
6                              Angola                      T-55                   200    Soviet Union
7                              Angola                      T-62                    50    Soviet Union
8                              Angola                      T-72                    50    Soviet Union
9                           Argentina  Tanque Argentino Mediano                   231       Argentina
10                            Armenia                      T-55                     5    Soviet Union
11                            Armenia                      T-72                   168    Soviet Union
12                            Armenia                      T-80                    20    Soviet Union
13                          Australia           M1A1 AIM Abrams                    59   United States
14                            Austria                 Leopard 2                    56         Germany
15                         Azerbaijan                      T-90                   200          Russia
16                         Azerbaijan                T-72 Aslan                   420          Russia
17                         Azerbaijan                      T-55                   100    Soviet Union
18                            Bahrain                    M60 A3                   180   United States
19                         Bangladesh       Type 59G(BD) Durjoy                   474           China
20                         Bangladesh                   Type 69                    58           China
21                         Bangladesh                  MBT-2000                    44           China
22                            Belarus               T-72B Vitaz                   446    Soviet Union
23                            Belarus                      T-80                    69    Soviet Union
24             Bosnia and Herzegovina                      M-84                    71      Yugoslavia
25             Bosnia and Herzegovina                   AMX-30S                    50          France
26             Bosnia and Herzegovina                     M60A3                    85   United States
27             Bosnia and Herzegovina                      T-55                   142    Soviet Union
28                             Brazil              EE-T1 Os√≥rio                     2          Brazil
29                             Brazil                 M60A3 TTS                    91   United States
30                             Brazil                 Leopard 1                   127         Germany
31                             Brazil                 Leopard 1                   221         Germany
32                           Bulgaria                      T-72                   181    Soviet Union
33                           Cambodia                      T-55                   103    Soviet Union
34                           Cambodia                   Type 59                   200           China
35                             Canada                Leopard C2                   761         Germany
36                             Canada                 Leopard 2                   820         Germany
37                             Canada               Leopard 2A4                   680         Germany
38           Central African Republic                      T-55                     4    Soviet Union
39                               Chad                      T-55                    60    Soviet Union
40                              Chile                 Leopard 2                   172         Germany
41                              Chile                 Leopard 1                   100         Germany
42                              China                   Type 15                   200           China
43                              China                   Type 99                  1000           China
44                              China                   Type 96                  2700           China
45                              China                   Type 88                   500           China
46                              China                   Type 69                   200           China
47                              China                   Type 59                  2360           China
48   Democratic Republic of the Congo                   Type 59                    30           China
49   Democratic Republic of the Congo                      T-55                    20    Soviet Union
50                              Congo                   Type 59                    20           China
51                            Croatia               M-95 Degman                     2         Croatia
52                            Croatia             M-84A4 Sniper                    75         Croatia
53                               Cuba                      T-55                  1100    Soviet Union
54                               Cuba                      T-62                   400    Soviet Union
55                             Cyprus                  AMX-30B2                    52          France
56                             Cyprus                   AMX-30G                    30          France
57                             Cyprus                     T-80U                    82          Russia
58                     Czech Republic                 T-72M4 CZ                    30  Czech Republic
59                     Czech Republic                      T-72                    93    Soviet Union
60                            Denmark               Leopard 2A4                    57         Germany
61                 Dominican Republic        M41 Walker Bulldog                     6   United States
62                            Ecuador                 Leopard 1                    60         Germany
63                            Ecuador                    AMX-13                    80          France
64                            Ecuador                      T-55                     3    Soviet Union
65                              Egypt                      T-55                   340    Soviet Union
66                              Egypt                 Ramses II                   425           Egypt
67                              Egypt                      T-62                   500    Soviet Union
68                              Egypt                      T-80                    34    Soviet Union
69                              Egypt                     M60A3                  1716   United States
70                  Equatorial Guinea                      T-55                     3    Soviet Union
71                            Eritrea                 T-55A/AM2                   300    Soviet Union
72                           Ethiopia                      T-55                   170    Soviet Union
73                           Ethiopia                      T-62                    50    Soviet Union
74                           Ethiopia                      T-72                    50    Soviet Union
75                            Finland                 Leopard 2                   139         Germany
76                            Finland                 Leopard 2                   100         Germany
77                             France                   Leclerc                   406          France
78                            Georgia                      T-72                   120    Soviet Union
79                            Georgia                      T-55                    23    Soviet Union
80                            Germany               Leopard 2A5                   250         Germany
81                             Greece           Leopard 2A6 HEL                   170         Germany
82                             Greece               Leopard 2A4                   183         Germany
83                             Greece               Leopard 1A4                   501         Germany
84                             Greece                     M60A3                   101   United States
85                             Greece                M48A5 MOLF                   390   United States
86                             Guinea                      T-55                     8    Soviet Union
87                      Guinea-Bissau                      T-55                    10    Soviet Union
88                            Hungary                 Leopard 2                    44         Germany
89                            Hungary                 Leopard 2                    12         Germany
90                            Hungary                    T-72M1                   107    Soviet Union
91                              India                 Arjun MBT                   370           India
92                              India                      T-90                  2011          Russia
93                              India                      T-72                  2414    Soviet Union
94                          Indonesia                 Leopard 2                    42         Germany
95                          Indonesia      Leopard 2 Revolution                    61         Germany
96                          Indonesia                    AMX-13                   325          France
97                          Indonesia                M48 Patton                   108   United States
98                          Indonesia                M60 Patton                   150   United States
99                          Indonesia             Chieftain MK3                   100  United Kingdom
100                         Indonesia                      T-62                    75    Soviet Union
101                         Indonesia                     T-72S                   480    Soviet Union
102                         Indonesia              Zulfiqar MBT                   150            Iran
103                         Indonesia                    Karrar                   420            Iran
104                              Iraq                      T-55                    72    Soviet Union
105                              Iraq               M1A1 Abrams                   146   United States
106                              Iraq                      T-72                   125    Soviet Union
107                            Israel              Merkava Mk.1                   180          Israel
108                            Israel              Merkava Mk.2                   400          Israel
109                            Israel              Merkava Mk.3                   780          Israel
110                            Israel              Merkava Mk.4                   660          Israel
111                            Israel                  Magach 6                   560   United States
112                            Israel                  Magach 7                  1600   United States
113                             Italy                    Ariete                   200           Italy
114                       Ivory Coast                      T-55                    10    Soviet Union
115                             Japan                   Type 74                   700           Japan
116                             Japan                   Type 90                   341           Japan
117                             Japan                   Type 10                    80           Japan
118                            Jordan                     Tariq                   292  United Kingdom
119                            Jordan                     M60A3                   250   United States
120                            Jordan                    Khaled                   274  United Kingdom
121                            Jordan              Challenger 1                   392  United Kingdom
122                        Kazakhstan                      T-55                   540    Soviet Union
123                        Kazakhstan                      T-62                    75    Soviet Union
124                        Kazakhstan                      T-72                   650    Soviet Union
125                             Kenya              Vickers Mk 3                    78  United Kingdom
126                             Kenya                      T-72                    76    Soviet Union
127                       North Korea                      T-55                  2000    Soviet Union
128                       North Korea                      T-62                  1000    Soviet Union
129                       North Korea                   Type 59                  1000           China
130                       North Korea                 Chonma-ho                  1000     North Korea
131                       North Korea                Pokpung-ho                   500     North Korea
132                       South Korea                    M48A3K                   300   United States
133                       South Korea                   M48A5K1                   500   United States
134                       South Korea                      T-80                    35    Soviet Union
135                       South Korea                        K1                  1511     South Korea
136                       South Korea          K2 Black Panther                   206     South Korea
137                            Kuwait                      M-84                   150      Yugoslavia
138                            Kuwait                      M1A2                   218   United States
139                        Kyrgyzstan                      T-72                   210    Soviet Union
140                              Laos                   T-54/55                    15    Soviet Union
141                              Laos                   T-34/85                    10    Soviet Union
142                            Latvia                      T-55                     3    Soviet Union
143                           Lebanon                      T-55                   205    Soviet Union
144                           Lebanon                     M48A5                   104   United States
145                           Lebanon                     M60A3                    66   United States
146                           Lebanon                 Leopard 1                    43         Germany
147                           Lebanon                      T-55                  1500    Soviet Union
148                           Lebanon                      T-62                   350    Soviet Union
149                           Lebanon                      T-72                   315    Soviet Union
150             Republic of Macedonia                      T-72                    31    Soviet Union
151             Republic of Macedonia                      T-55                    98    Soviet Union
152                            Malawi                      T-55                     1    Soviet Union
153                          Malaysia                    PT-91M                    48          Poland
154                          Malaysia                      T-55                    33    Soviet Union
155                        Mauritania                      T-55                    35    Soviet Union
156                           Moldova                      T-64                     3    Soviet Union
157                          Mongolia                      T-54                   200    Soviet Union
158                          Mongolia                      T-55                   170    Soviet Union
159                          Mongolia                      T-62                   250    Soviet Union
160                          Mongolia                      T-72                   100    Soviet Union
161                           Morocco                      M1A1                   222   United States
162                           Morocco                 Al-Khalid                   150        Pakistan
163                           Morocco                      T-72                   148    Soviet Union
164                           Morocco                     M60A3                   427   United States
165                           Morocco                       M48                   224   United States
166                        Mozambique                      T-55                    80    Soviet Union
167                           Myanmar                   Type 59                   280           China
168                           Myanmar                   Type 69                   190           China
169                           Myanmar                      T-72                   139    Soviet Union
170                           Myanmar                  MBT-2000                   200           China
171                           Namibia                      T-55                     1    Soviet Union
172                       Netherlands                 Leopard 2                    18         Germany
173                         Nicaragua                      T-55                    31    Soviet Union
174                           Nigeria                      T-55                    24    Soviet Union
175                           Nigeria                      T-72                    16    Soviet Union
176                           Nigeria               Vickers MBT                   108  United Kingdom
177                           Nigeria                    AMX-30                    16          France
178                            Norway             Leopard 2A4NO                    52         Germany
179                              Oman                     M60A3                    73   United States
180                              Oman              Challenger 2                    38  United Kingdom
181                          Pakistan              Type 85-IIAP                   300           China
182                          Pakistan                    T-80UD                   320    Soviet Union
183                          Pakistan                 Al-Zarrar                   600           China
184                          Pakistan                 Al-Khalid                   300           China
185                          Paraguay                M4 Sherman                     8   United States
186                              Per√∫                      T-55                   240    Soviet Union
187                            Poland                    T-72M1                   584    Soviet Union
188                            Poland                     PT-91                   232          Poland
189                            Poland                 Leopard 2                   247         Germany
190                          Portugal                M-60 A3TTS                    96   United States
191                          Portugal                 Leopard 2                    37         Germany
192                          Portugal              M48A5 Patton                    86   United States
193                             Qatar                 Leopard 2                    62         Germany
194                           Romania                      T-55                   250    Soviet Union

In [207]:
#list of all countries available in data
countries_lst = A + D
# print(sorted(set(countries_lst)))

In [190]:
#create database
import sqlalchemy as db
from sqlalchemy.orm import sessionmaker

from models import Alliance, Country, Tank

if __name__ == "__main__":
    engine = db.create_engine("sqlite:///main.db")

    Session = sessionmaker(bind=engine)

    session = Session()

In [191]:
#Create country table
for i in range(len(set(countries_lst))):
    country = Country(name=sorted(set(countries_lst))[i])
    session.add(country)
    session.commit()

In [209]:
#create dictionary to easily acess a country ID
dictionary = {}
for instance in session.query(Country).all():
    dictionary[instance.name] = instance.id

In [193]:
#Create tank table
for i in range(len(A)):
    tank = Tank(name=B[i], quantity=C[i], country_id=dictionary[A[i]], origin_id=dictionary[D[i]])
    session.add(tank)
    session.commit()

In [129]:
#import alliance dataset
import os
os.getcwd()
df1 = pd.read_csv("alliance_v4.1_by_directed.csv", dtype = {"dyad_st_year": int}, usecols = ['state_name1', 'state_name2', 'dyad_st_year', 'dyad_end_year'] )
df1

,state_name1,state_name2,dyad_st_year,dyad_end_year
0,United Kingdom,Portugal,1816,NaN
1,Portugal,United Kingdom,1816,NaN
2,United Kingdom,Sweden,1816,1911.0
3,Sweden,United Kingdom,1816,1911.0
4,Hanover,Bavaria,1838,1848.0
...,...,...,...,...
6439,South Sudan,Sudan,2012,2012.0
6440,Egypt,Israel,1979,NaN
6441,Israel,Egypt,1979,NaN
6442,United States of America,Israel,1981,1991.0
6443,Israel,United States of America,1981,1991.0

In [199]:
#abandon countries which aren't in countries_lst
df_state_1 =  df1[df1['state_name1'].isin(sorted(set(countries_lst)))]
df_state_1

         state_name1               state_name2  dyad_st_year  dyad_end_year
0     United Kingdom                  Portugal          1816            NaN
1           Portugal            United Kingdom          1816            NaN
2     United Kingdom                    Sweden          1816         1911.0
3             Sweden            United Kingdom          1816         1911.0
40           Germany                   Hanover          1838         1848.0
...              ...                       ...           ...            ...
6437         Armenia                    Russia          2010            NaN
6438           Sudan               South Sudan          2012         2012.0
6440           Egypt                    Israel          1979            NaN
6441          Israel                     Egypt          1979            NaN
6443          Israel  United States of America          1981         1991.0

[3953 rows x 4 columns]

In [200]:
#abandon countries which aren't in countries_lst
df_state_2 =  df_state_1[df_state_1['state_name2'].isin(sorted(set(countries_lst)))]
df_state_2

         state_name1     state_name2  dyad_st_year  dyad_end_year
0     United Kingdom        Portugal          1816            NaN
1           Portugal  United Kingdom          1816            NaN
2     United Kingdom          Sweden          1816         1911.0
3             Sweden  United Kingdom          1816         1911.0
188   United Kingdom         Germany          1816         1822.0
...              ...             ...           ...            ...
6435         Belarus          Russia          2009            NaN
6436          Russia         Armenia          2010            NaN
6437         Armenia          Russia          2010            NaN
6440           Egypt          Israel          1979            NaN
6441          Israel           Egypt          1979            NaN

[2806 rows x 4 columns]

In [210]:
#leave only alliances which have no ending year - they are still valid
df_end = df_state_2[~df_state_2['dyad_end_year'].notnull()]
df_end

         state_name1     state_name2  dyad_st_year  dyad_end_year
0     United Kingdom        Portugal          1816            NaN
1           Portugal  United Kingdom          1816            NaN
1830      Mauritania         Somalia          1974            NaN
1832      Mauritania         Morocco          1973            NaN
1833      Mauritania         Algeria          1973            NaN
...              ...             ...           ...            ...
6435         Belarus          Russia          2009            NaN
6436          Russia         Armenia          2010            NaN
6437         Armenia          Russia          2010            NaN
6440           Egypt          Israel          1979            NaN
6441          Israel           Egypt          1979            NaN

[1492 rows x 4 columns]

In [203]:
end_year_lst = df_end['dyad_end_year'].tolist()
country_1_lst = df_end['state_name1'].tolist()
country_2_lst = df_end['state_name2'].tolist()
start_year_lst = df_end['dyad_st_year'].tolist()

In [204]:
# Create Alliance table
for i in range(len(country_1_lst)):
    alliance = Alliance(country1_id=dictionary[country_1_lst[i]], country2_id=dictionary[country_2_lst[i]], start_year=start_year_lst[i], end_year=end_year_lst[i])
    session.add(alliance)
    session.commit()

In [211]:
session.close()